Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Perl provides customary quote characters for these behaviors, but also provides a way for you to choose your quote character for any of them.
es_es: Perl no solo proporciona caracteres normales de entrecomillado para estos comportamientos, sino que también proporciona una manera para que usted elija su carácter de entrecomillado para cualquiera de ellos.

source: If the left value is greater than the right value then it returns the empty list.
es_es: Si el valor de la izquierda es mayor que el valor de la derecha entonces devuelve la lista vacía.

source: In particular, though the first such conversion may be time-consuming, repeated operations will not need to redo the conversion.
es_es: Así, aunque la primera conversión tarde un poco más, al repetir una operación no será necesario repetir la conversión.

source: print $list[$_] foreach 0 ..
es_es: print $lista[$_] foreach 0 ..

source: Use here documents instead of repeated C<print()> statements.
es_es: Use documentos incluídos en vez de repetir instrucciones C<print()>.

source: If there is a syntax error or runtime error, or a C<die> statement is executed, C<eval> returns C<undef> in scalar context or an empty list--or, for syntax errors, a list containing a single undefined value--in list context, and C<$@> is set to the error message.
es_es: Si hay algún error de sintaxis o en tiempo de ejecución, o se ejecuta una instrucción C<die>, C<eval> devuelve un valor C<undef> en contexto escalar o una lista vacía -o, para errores sintácticos, una lista conteniendo un único valor indefinido- en contexto de lista, y C<$@> es inicializado al mensaje de error.

source: The first (and for a long time, only) periodical devoted to All Things Perl, I<The Perl Journal> contains tutorials, demonstrations, case studies, announcements, contests, and much more.
es_es: La primera publicación periódica (y, durante mucho tiempo, la única) dedicada al mundo Perl, I<The Perl Journal> contiene tutoriales, demostraciones, estudios de casos, anuncios, concursos y mucho más.

source: Otherwise, if the REPLACEMENTLIST is shorter than the SEARCHLIST, the final character is replicated till it is long enough.
es_es: De lo contrario, si la LISTA_REEMPLAZO es más corta que la LISTA_BÚSQUEDA, el carácter final es replicado hasta que sea lo suficientemente larga.

source: is not ok, as the regex engine will end up trying to compile the pattern C<\>, which it will consider a syntax error.
es_es: no es correcto, porque el motor de expresiones regulares acabará tratando de compilar el patrón C<\>, que va generar un error de sintaxis.

source: # read in config files: system first, then user
es_es: # leer en archivos de configuración: primero el sistema, luego el usuario

source: =item (?{ CODE })
es_es: =item (?{ CÓDIGO })

source: Any non-whitespace delimiter may replace the slashes.
es_es: Cualquier delimitador distinto del espacio en blanco puede sustituir a las barras.

source: by Jon Bentley
es_es: Jon Bentley

source: Alternately, if the handle is not marked with an encoding but you attempt to write characters with code points over 255, raises an exception.
es_es: Alternativamente, si el gestor no está marcado con una codificación pero intenta escribir caracteres con puntos de código superiores a 255, se genera una excepción.

source: my (@AoA, $i, $line);
es_es: my (@AoA, $i, $linea);

# print "Defined " if defined $array[$index];
source: print "Defined\n" if defined $array[$index];
es_es: print "Definido\n" if defined $array[$indice];

source: Will both leave the sentence as is.
es_es: Ambas dejará la instrucción como estaba.

source: Perl cannot be compiled with threading support ATM.
es_es: Perl no puede ser compilado con soporte multihilo ATM.

source: See B::Bytecode.
es_es: Vea B::Bytecode.

source: print (1+2)+4; # Also prints 3!
es_es: print (1+2)+4; # ¡También imprime 3!

source: Consider the pattern C<A (*PRUNE) B>, where A and B are complex patterns.
es_es: Considere el patrón C<A (*PRUNE) B>, donde A y B son patrones complejos.

source: to compile Perl 32-bit.
es_es: para compilar Perl de 32 bit.

source: This is because C<chomp $cwd = `pwd`;> is interpreted as C<(chomp $cwd) = `pwd`;>, rather than as C<chomp( $cwd = `pwd` )> which you might expect.
es_es: Esto es porque C<chomp $cwd = `pwd`;> es interpretado como C<(chomp $cwd) = `pwd`;>, en vez de un C<chomp( $cwd = `pwd` )> que es lo que se esperaba.

source: See L<DB_File> or the F<Config> module for interesting C<tie> implementations.
es_es: Ver L<DB_File> o el módulo F<Config> para interesantes implementaciones de C<tie>.

source: warn "not a decimal number" unless /^-?(?:\d+(?:\.\d*)?|\.\d+)$/;
es_es: warn "no es número real" unless /^-?(?:\d+(?:\.\d*)?|\.\d+)$/;

source: The standard C<Math::BigInt>, C<Math::BigRat>, and C<Math::BigFloat> modules, along with the C<bigint>, C<bigrat>, and C<bitfloat> pragmas, provide variable-precision arithmetic and overloaded operators, although they're currently pretty slow.
es_es: Los módulos estándar C<Math::BigInt>, C<Math::BigRat>, y C<Math::BigFloat>, junto con los I<pragmas> C<bigint>, C<bigrat> y C<bigfloat>, proporcionan aritmética con precisión variable y sobrecarga de operadores, aunque, en la actualidad, son bastante lentos.

source: See L<perlfunc> for details.
es_es: Vea L<perlfunc> para más detalles.

source: This may or may not save time, depending on the nature and number of patterns you are searching and the distribution of character frequencies in the string to be searched; you probably want to compare run times with and without it to see which is faster.
es_es: Esto puede o no ahorrar tiempo, dependiendo de la naturaleza y el número de patrones que esté buscando y sobre la distribución de frecuencias de caracteres de la cadena a buscar; probablemente querrá comparar los tiempos de funcionamiento con y sin él para ver qué funciona más rápido.

source: A good rule of thumb is that if your platform has a real C<fork()> (in other words, if your platform is Unix, including Linux and MacOS X), you can use the list form.
es_es: Una buena regla general es que si su plataforma tiene una verdadera función C<fork()> (en otras palabras, si su plataforma es Unix, incluyendo Linux y MacOS X), puede utilizar la forma de lista.

source: If you see don't see AUTOCONF or MPEAUTOCONF, make sure you get a new version.
es_es: Si no ve AUTOCONF o MPEAUTOCONF, asegúrese de que obtiene una versión nueva.

source: =item splice ARRAY or EXPR,OFFSET,LENGTH,LIST X<splice>
es_es: =item splice ARRAY o DESPLAZAMIENTO,LONGITUD,LISTA X<splice>

source: =head2 C<chdir>, C<chmod> and C<chown> on filehandles
es_es: =head2 C<chdir>, C<chmod> y C<chown> en identificadores de archivos

source: Note that the number of exponent digits in the scientific notation produced by C<%e>, C<%E>, C<%g> and C<%G> for numbers with the modulus of the exponent less than 100 is system-dependent: it may be three or less (zero-padded as necessary).
es_es: Tenga en cuenta que el número de dígitos del exponente en notación científica producida por C<%e>, C<%E>, C<%g> y C<%G> para los números con el módulo del exponente menor de 100 es dependiente del sistema: puede ser de tres o menos (con relleno de ceros según sea necesario).

source: If LENGTH is omitted, removes everything from OFFSET onward.
es_es: Si se omite LONGITUD, se suprime todo desde DESPLAZAMIENTO en adelante.

source: } elsif (!$result) { delete $INC{$filename}; die "$filename did not return true value";
es_es: } elsif (!$resultado) { delete $INC{$archivo}; die "$archivo no devolvió un valor verdadero";

source: More detailed information about Perl syntax can be found in L<perlsyn>.
es_es: Encontrará información más detallada sobre la sintaxis de Perl en L<perlsyn>.

source: Larry doesn't really care.
es_es: A Larry le da igual.

source: The variables are scoped to the block (i.e. a bunch of statements surrounded by curly-braces) in which they are defined.
es_es: El ámbito de las variables es el bloque (conjunto de instrucciones entre llaves) en el que se definen.

source: # the traditional way
es_es: # la manera tradicional

source: Binary "%" is the modulo operator, which computes the division remainder of its first argument with respect to its second argument.
es_es: Binario "%" es el operador módulo, que calcula el resto de la división de su primer argumento con respecto a su segundo argumento.

source: See L<perlref>, L<perlsub>, and L<perlmod/"Symbol Tables"> for more discussion on typeglobs and the C<*foo{THING}> syntax.
es_es: Ver L<perlref>, L<perlsub> y L<perlmod/"Tablas de símbolos"> para una mayor discusión sobre typeglobs y la sintaxis <C*foo{COSA}>.

source: This permits more elaborate exception handling using objects that maintain arbitrary state about the exception.
es_es: Esto permite un manejo de las excepciones más elaborado que usando objetos que mantengan un estado arbitrario sobre la naturaleza de la excepción.

source: Unary "~" performs bitwise negation, i.e., 1's complement.
es_es: Unario "~" realiza la negación bit a bit, es decir, el complemento a uno.

source: If you I<need> to use literal backslashes within C<\Q...\E>, consult L<perlop/"Gory details of parsing quoted constructs">.
es_es: Si I<necesita> usar contrabarras literales dentro de C<\Q...\E>, consulte L<perlop/"Detalles sangrientos del análisis de las construcciones entrecomilladas">.

source: README.freebsd - Perl version 5 on FreeBSD systems
es_es: README.freebsd - Perl versión 5 sobre sistemas FreeBSD

source: Module authors should carefully consider whether to rely on other modules, and which modules to rely on.
es_es: Los autores de módulos deben considerar cuidadosamente si se basan en otros módulos, y en qué módulos quieren confiar.

source: C<$sec>, C<$min>, and C<$hour> are the seconds, minutes, and hours of the specified time.
es_es: $seg, $min y $hora son los segundos, minutos y horas del tiempo especificado.

source: See L<perlform>
es_es: Vea L<perlform>

source: Note that parentheses are necessary when you're chomping anything that is not a simple variable.
es_es: Nota que los paréntesis son necesarios cuando esté recortando cualquier cosa que no sea una simple variable.

source: > greater than
es_es: > mayor que

source: =item Separate functionality from output.
es_es: =item Separe la funcionalidad de la salida.

source: The possible values and flag bits of the MODE parameter are system-dependent; they are available via the standard module C<Fcntl>.
es_es: Los valores posibles y bits de bandera del parámetro MODO son dependientes del sistema; están disponibles en el módulo estándar C<Fcntl>.

source: Deletes a list of files.
es_es: Elimina una lista de archivos.

source: The lack of processing of C<\\> creates specific restrictions on the post-processed text.
es_es: La falta de tratamiento de C<\\> crea restricciones específicas en el pos-procesado del texto.

source: Sources of further information
es_es: Fuentes de información adicional

source: The operating system, device drivers, C libraries, and Perl run-time system all conspire to let the programmer treat a single character (C<\n>) as the line terminator, irrespective of external representation.
es_es: El sistema operativo, gestores de dispositivos, bibliotecas C y Perl en tiempo de ejecución conspiran al unísono para permitirle al programador tratar un simple carácter (C<\n>) como el final de línea, independientemente de su representación externa.

source: # before ---------------branch-reset----------- after
es_es: # antes -------------reinicio de rama--------- después

source: =head2 Ports
es_es: =head2 Adaptaciones

source: The following statement:
es_es: La siguiente instrucción:

source: A group may take a repeat count either as postfix, or for unpack(), also via the C</> template character.
es_es: Un grupo puede tener un contador de repeticiones, ya sea de forma postfija, o para unpack(), también a través del carácter de plantilla C</>.

source: delete $ARRAY[$index];
es_es: delete $ARRAY[$indice];

source: =item cos EXPR X<cos> X<cosine> X<acos> X<arccosine>
es_es: =item cos EXPR X<cos> X<cosine> X<acos> X<arccosine> X<coseno> X<arco coseno>

source: Perl_save_bool() has been added.
es_es: Perl_save_bool() ha sido añadido.

source: Most importantly, many bugs were fixed, including several security problems.
es_es: Más importante aún, muchos errores han sido solucionados, incluyendo varios problemas de seguridad.

source: C<Term::ReadLine> upgraded to version 1.02
es_es: C<Term::ReadLine> actualizado a la versión 1.02

source: Note that functions such as C<keys> and C<values> may return huge lists when used on large objects, like DBM files.
es_es: Note que las funciones como C<keys> y C<values> pueden devolver largas listas como cuando se usan con grandes archivos DBM.

source: All rights reserved.
es_es: Reservados todos los derechos.

source: If you have Perl installed locally, you probably have the documentation installed as well: type C<man perl> if you're on a system resembling Unix.
es_es: Si ha instalado Perl localmente, es probable que también haya instalado la documentación: si está en un sistema Unix o similar, escriba C<man perl>.

source: In the latest Tru64 releases (e.g. v5.1B or later) gcc cannot be used to compile a threaded Perl (-Duseithreads) because the system C<< <pthread.h> >> file doesn't know about gcc.
es_es: En las últimas versiones de Tru64 (por ejemplo, v5.1B o posterior) gcc no se puede utilizar para compilar un Perl con soporte de hilos de ejecución (-Duseithreads) debido a que el fichero del sistema C<< <pthread.h> >> no sabe nada sobre gcc.

source: Regex Hash hash key grep grep /$a/, keys %$b
es_es: Regex Hash grep clave hash grep /$a/, keys %$b

source: @list = (2.18 ..
es_es: @lista = (2.18 ..

source: my @modules = $inst->modules();
es_es: my @modulos = $inst->modules();

source: ($a = $b) or $c; # really means this
es_es: ($a = $b) or $c; # en realidad significa esto

source: Perl is a general-purpose programming language originally developed for text manipulation and now used for a wide range of tasks including system administration, web development, network programming, GUI development, and more.
es_es: Perl es un lenguaje de programación de propósito general desarrollado originalmente para la manipulación de texto y que, en la actualidad, se usa para una amplia gama de tareas, como administración de sistemas, desarrollo web, programación de red, desarrollo de interfaces gráficas de usuario, etc.

source: =item C<(*MARK:NAME)> C<(*:NAME)> X<(*MARK)> C<(*MARK:NAME)> C<(*:NAME)>
es_es: =item C<(*MARK:NOMBRA)> C<(*:NOMBRE)> X<(*MARK)> C<(*MARK:NOMBRE)> C<(*:NOMBRE)>

source: $bar = q('This is it.');
es_es: $bar = q('Así es.');

source: Always use the two-argument version if a derived class might inherit the function doing the blessing.
es_es: Siempre usar la versión de dos argumentos si una clase derivada puede heredar la función con un nuevo bautizo.

source: An improved implementation of C<threads::shared> is available on CPAN - this will be merged into 5.8.9 if it proves stable.
es_es: Una mejor implementación de C<threads::shared> está disponible en CPAN - esto será fusionado en 5.8.9 si se prueba que es estable.

source: @days[3..5] = qw/Wed Thu Fri/;
es_es: @dias[3..5] = qw/Mié Jue Vie/;

source: Determination of whether $BSD_STYLE should be set is left as an exercise to the reader.
es_es: La determinación de cómo poner $BSD_STYLE se deja como ejercicio al lector.

source: In other words, C<our> has the same scoping rules as C<my> or C<state>, but does not necessarily create a variable.
es_es: En otras palabras, C<our> tiene las mismas reglas de alcance que C<my> o C<state>, pero no crea, necesariamente, una variable.

source: Note also that some versions of C<flock> cannot lock things over the network; you would need to use the more system-specific C<fcntl> for that.
es_es: Note también que algunas versiones de C<flock> no pueden bloquear cosas sobre la red; necesitará usar un C<fcntl> más específico del sistema para hacer esto.

source: =head2 Enabling warnings from your shell environment
es_es: =head2 Activando advertencias desde su entorno del shell

source: This is intentional.
es_es: Esto es intencional.

source: Prepends list to the front of the array and returns the new number of elements in the array.
es_es: Antepone LISTA al principio del array, y devuelve el número de elementos en el array.

source: C<Opcode> upgraded to version 1.06
es_es: C<Opcode> actualizado a la versión 1.06

source: The array grows or shrinks as necessary.
es_es: El array crece o se reduce según sea necesario.

source: An OFFSET may be specified to write the data from some part of the string other than the beginning.
es_es: Un DESPLAZAMIENTO puede ser especificado para escribir datos desde algún otro lugar de la cadena distinto del principio.

source: (In other words, names beginning with $ or @, followed by an optional bracketed expression as a subscript.) The following code segment prints out "The price is $Z<>100." X<interpolation>
es_es: (En otras palabras, nombres que empiezan con $ o @, seguido de una opcional expresión entre corchetes como si fuera un subíndice). El segmento de código siguiente imprime "El precio es $Z<>100". X<interpolation> X<interpolación>

source: (Note that the similar construct, but with C<eval("")> instead, was already forbidden.)
es_es: (Note que la construcción similar, pero usando C<eval("")>, ya estaba prohibida.)

source: Binary "ne" returns true if the left argument is stringwise not equal to the right argument.
es_es: Binario "ne" devuelve verdadero si el argumento de la izquierda es alfanuméricamente distinto que el argumento de la derecha.

source: One can replace a numeric repeat count with a template letter enclosed in brackets to use the packed byte length of the bracketed template for the repeat count.
es_es: Se puede reemplazar un número de repeticiones con una plantilla de letras encerrada entre corchetes para utilizar la longitud en bytes empaquetada de la plantilla entre corchetes para indicar ese número de repeticiones.

source: Perl has traditionally been supported by Larry, scores of software designers and developers, and myriad programmers, all working for free to create a useful thing to make life better for everyone.
es_es: Tradicionalmente, el soporte de Perl lo han proporcionado Larry, grupos de diseñadores y desarrolladores de software, y un sinnúmero de programadores, todos dedicados a crear algo útil que nos facilite la vida.

# print "LA LA LA " while 1; # loops forever
source: print "LA LA LA\n" while 1; # loops forever
es_es: print "LA LA LA\n" while 1; # bucle sin fin

source: Devel::PPPort upgraded to version 3.03
es_es: Devel::PPPort actualizado a la versión 3.03

source: In those cases where C<HvENAME()> returns null, C<HvNAME()> should be used instead.
es_es: En los casos donde C<HvENAME()> devuelve un valor nulo, en su lugar se debe usar C<HvNAME()>.

source: require Foo::Bar; # a splendid bareword
es_es: require Foo::Bar; # algo atractivo

source: The BLOCK construct can be used to emulate case structures.
es_es: La construcción BLOQUE puede ser usada para emular estructuras I<switch>.

source: You're a much better advocate if your claims are reasonable and grounded in reality.
es_es: Si sus afirmaciones son razonables y están basadas en la realidad, sus esfuerzos de evangelización tendrán más éxito.

source: the pattern explicitly mentions a code point that is above 255 (say by C<\x{100}>); or
es_es: el patrón menciona explícitamente un punto de código que está por encima de 255 (por ejemplo C<\x{100}>); o

source: ($login,$pass,$uid,$gid) = getpwnam($user)
es_es: ($login,$pass,$uid,$gid) = getpwnam($usuario)

source: shutdown(SOCKET, 2); # I/we have stopped using this socket
es_es: shutdown(SOCKET, 2); # Hemos dejado de usar el socket

source: The original culture of the pre-populist Internet and the deeply-held beliefs of Perl's author, Larry Wall, gave rise to the free and open distribution policy of perl.
es_es: La cultura de Internet existente antes de que "la red" se convirtiera en un fenómeno de masas, y las firmes convicciones de Larry Wall, el creador de Perl, dieron lugar a la política de distribución libre y abierta de perl.

source: C<Win32> upgraded to version 0.2601
es_es: C<Win32> actualizado a la versión 0.2601

source: See L</"The C<overloading> pragma"> above.
es_es: Vea más arriba L</"El I<pragma> C<overloading>.

source: perl5130delta Perl changes in version 5.13.0
es_es: perl5130delta Cambios en la versión 5.13.0

source: Whereas if you comment out the two lines I said you might wish to, then it shows it to you this way instead:
es_es: Mientras que si comenta las dos líneas que le he dicho antes, entonces se lo muestra de esta manera:

source: fcntl($filehandle, F_GETFL, $packed_return_buffer)
es_es: fcntl($identificador, F_GETFL, $búfer_retorno_empaquetado)

source: Otherwise, because we didn't C<chdir> there, it would have been testing the wrong file.
es_es: De lo contrario, porque no hicimos un C<chdir> antes, se estará probando en un archivo incorrecto.

source: =head2 What is Perl?
es_es: =head2 ¿Qué es Perl?

source: This works with both Cygwin 1.3.22 and Cygwin 1.5.3.
es_es: Esto funciona tanto con Cygwin 1.3.22 y Cygwin 1.5.3.

source: Try "/hurd/pfinet --help" for more information.
es_es: Pruebe "/hurd/pfinet --help" para obtener más información.

source: Currently, those are perl5.14.x and perl5.12.x, respectively.
es_es: En la actualidad, éstas son perl5.14.x y perl5.12.x respectivamente.

source: For instance, if you're using ftp://ftp.funet.fi/pub/languages/perl/CPAN as your CPAN site, the file C<CPAN/misc/japh> is downloadable as ftp://ftp.funet.fi/pub/languages/perl/CPAN/misc/japh .
es_es: Por ejemplo, si usa ftp://ftp.funet.fi/pub/languages/perl/CPAN como sitio de CPAN, puede descargar el archivo C<CPAN/misc/japh> como ftp://ftp.funet.fi/pub/languages/perl/CPAN/misc/japh .

source: Win32: non-blocking waitpid(-1,WNOHANG)
es_es: Win32: waitpid(-1,WNOHANG) no bloqueante

source: =item C<< (?PE<lt>NAMEE<gt>pattern) >>
es_es: =item C<< (?PE<lt>NOMBRE<gt>patrón) >>

source: Perl was born in Unix and can therefore access all common Unix system calls.
es_es: Perl nació en Unix y por eso puede acceder a todas las llamadas normales del sistema Unix.

source: Here is a DBM Filter that does it:
es_es: El siguiente filtro DBM hace esto:

source: printf '<%010.6d>', 1; # prints "< 000001>"
es_es: printf '<%010.6d>', 1; # imprime "< 000001>"

source: If your integer arguments are not literals and have never been interpreted in a numeric context, you may need to add C<0> to them to force them to look like numbers.
es_es: Si sus argumentos enteros no son enteros, y nunca han sido interpretados en un contexto numérico, es posible que deba agregarles C<0> para obligarles a que se parezcan a números.

source: C<wantarray()>'s result is unspecified in the top level of a file, in a C<BEGIN>, C<UNITCHECK>, C<CHECK>, C<INIT> or C<END> block, or in a C<DESTROY> method.
es_es: El resultado de C<wantarray()> no está especificado en el nivel superior de un archivo, en un C<BEGIN>, C<UNITCHECK>, C<CHECK>, C<INIT> o bloque C<END>, o en un método C<DESTROY>.

source: =head2 Debugger and Unicode slowdown
es_es: =head2 Enlentecimiento del depurador y de Unicode

source: The C<foreach> keyword is actually a synonym for the C<for> keyword, so you can use C<foreach> for readability or C<for> for brevity.
es_es: La palabra clave C<foreach> es realmente un sinónimo de la palabra clave C<for>, así que puede usar C<foreach> por legibilidad o C<for> por brevedad.
